src/docker/kubernates-handbook/theory/controller/stateful_set.org
#+TITLE: StatefulSet
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../css/main.css" />
#+HTML_LINK_UP: deployment.html
#+HTML_LINK_HOME: controller.html
#+OPTIONS: num:nil timestamp:nil ^:nil

StatefulSet 作为 Controller 为 _Pod_ *提供* _唯一的标识_ 。它可以 *保证* _部署_ 和 _scale_ 的顺序

#+BEGIN_EXAMPLE
  使用案例参考：https://github.com/kubernetes-retired/contrib/tree/master/statefulsets

  其中包含zookeeper和kakfa的statefulset设置和使用说明
#+END_EXAMPLE


StatefulSet是为了解决 *有状态服务* 的问题（对应Deployments和ReplicaSets是为无状态服务而设计），其应用场景包括：
+ 稳定的 _持久化存储_ 
  #+BEGIN_EXAMPLE
    即Pod重新调度后还是能访问到相同的持久化数据，基于PVC来实现
  #+END_EXAMPLE
+ 稳定的 _网络标志_ 
  #+BEGIN_EXAMPLE
    即Pod重新调度后其PodName和HostName不变，基于Headless Service（即没有Cluster IP的Service）来实现
  #+END_EXAMPLE
+ 有序部署， _有序扩展_ 
  #+BEGIN_EXAMPLE
    即Pod是有顺序的，在部署或者扩展的时候要依据定义的顺序依次依次进行

    即从0到N-1，在下一个Pod运行之前所有之前的Pod必须都是Running和Ready状态，基于init containers来实现
  #+END_EXAMPLE
+ 有序收缩， _有序删除_ 
  #+BEGIN_EXAMPLE
    即从N-1到0
  #+END_EXAMPLE


从上面的应用场景可以发现，StatefulSet由以下几个部分组成：
+ 用于 _定义_  *网络标志* （DNS domain）的 _Headless Service_
+ 用于 _创建_ *PersistentVolumes* 的 _volumeClaimTemplates_
+ _定义_ *具体应用* 的 _StatefulSet_

StatefulSet中每个Pod的 _DNS格式_ 为 _statefulSetName-{0..N-1}.serviceName.namespace.svc.cluster.local_ ，其中
+ serviceName: Headless Service的名字
+ 0..N-1: Pod所在的序号，从0开始到N-1
+ statefulSetName: StatefulSet的名字
+ namespace: 服务所在的namespace
  #+BEGIN_EXAMPLE
    Headless Servic和StatefulSet必须在相同的namespace
  #+END_EXAMPLE
+ .cluster.local: Cluster Domain
* 使用
StatefulSet 适用于有以下某个或多个需求的应用：
+ 稳定，唯一的网络标志
+ 稳定，持久化存储
+ 有序，优雅地部署和 scale
+ 有序，优雅地删除和终止
+ 有序，自动的滚动升级 

#+BEGIN_EXAMPLE
  稳定是 Pod （重新）调度中持久性的代名词，如果应用程序不需要任何稳定的标识符、有序部署、删除和 scale，则应该使用提供一组无状态副本的 controller 来部署应用程序

  例如 Deployment 或 ReplicaSet 可能更适合您的无状态需求
#+END_EXAMPLE
* 限制
+ 给定 Pod 的存储必须由 PersistentVolume Provisioner 根据请求的 storage class 进行配置，或由管理员预先配置
+ 删除或 scale StatefulSet 将不会删除与 StatefulSet 相关联的 volume
  #+BEGIN_EXAMPLE
    这样做是为了确保数据安全性，这通常比自动清除所有相关 StatefulSet 资源更有价值
  #+END_EXAMPLE
+ StatefulSets 目前要求 Headless Service 负责 Pod 的网络身份
  #+BEGIN_EXAMPLE
    使用者有责任创建此服务
  #+END_EXAMPLE
* 组件

