html/docker/kubernates-handbook/theory/controller/stateful_set.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>StatefulSet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="deployment.html"> UP </a>
 |
 <a accesskey="H" href="controller.html"> HOME </a>
</div><div id="content">
<h1 class="title">StatefulSet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9180e58">使用</a></li>
<li><a href="#orgab35ba9">限制</a></li>
<li><a href="#orgb6644c7">组件</a></li>
</ul>
</div>
</div>
<p>
StatefulSet 作为 Controller 为 <span class="underline">Pod</span> <b>提供</b> <span class="underline">唯一的标识</span> 。它可以 <b>保证</b> <span class="underline">部署</span> 和 <span class="underline">scale</span> 的顺序
</p>

<pre class="example">
  使用案例参考：https://github.com/kubernetes-retired/contrib/tree/master/statefulsets

  其中包含zookeeper和kakfa的statefulset设置和使用说明
</pre>


<p>
StatefulSet是为了解决 <b>有状态服务</b> 的问题（对应Deployments和ReplicaSets是为无状态服务而设计），其应用场景包括：
</p>
<ul class="org-ul">
<li><p>
稳定的 <span class="underline">持久化存储</span> 
</p>
<pre class="example">
    即Pod重新调度后还是能访问到相同的持久化数据，基于PVC来实现
</pre></li>
<li><p>
稳定的 <span class="underline">网络标志</span> 
</p>
<pre class="example">
    即Pod重新调度后其PodName和HostName不变，基于Headless Service（即没有Cluster IP的Service）来实现
</pre></li>
<li><p>
有序部署， <span class="underline">有序扩展</span> 
</p>
<pre class="example">
    即Pod是有顺序的，在部署或者扩展的时候要依据定义的顺序依次依次进行

    即从0到N-1，在下一个Pod运行之前所有之前的Pod必须都是Running和Ready状态，基于init containers来实现
</pre></li>
<li><p>
有序收缩， <span class="underline">有序删除</span> 
</p>
<pre class="example">
    即从N-1到0
</pre></li>
</ul>


<p>
从上面的应用场景可以发现，StatefulSet由以下几个部分组成：
</p>
<ul class="org-ul">
<li>用于 <span class="underline">定义</span>  <b>网络标志</b> （DNS domain）的 <span class="underline">Headless Service</span></li>
<li>用于 <span class="underline">创建</span> <b>PersistentVolumes</b> 的 <span class="underline">volumeClaimTemplates</span></li>
<li><span class="underline">定义</span> <b>具体应用</b> 的 <span class="underline">StatefulSet</span></li>
</ul>

<p>
StatefulSet中每个Pod的 <span class="underline">DNS格式</span> 为 <span class="underline">statefulSetName-{0..N-1}.serviceName.namespace.svc.cluster.local</span> ，其中
</p>
<ul class="org-ul">
<li>serviceName: Headless Service的名字</li>
<li>0..N-1: Pod所在的序号，从0开始到N-1</li>
<li>statefulSetName: StatefulSet的名字</li>
<li><p>
namespace: 服务所在的namespace
</p>
<pre class="example">
Headless Servic和StatefulSet必须在相同的namespace
</pre></li>
<li>.cluster.local: Cluster Domain</li>
</ul>
<div id="outline-container-org9180e58" class="outline-2">
<h2 id="org9180e58">使用</h2>
<div class="outline-text-2" id="text-org9180e58">
<p>
StatefulSet 适用于有以下某个或多个需求的应用：
</p>
<ul class="org-ul">
<li>稳定，唯一的网络标志</li>
<li>稳定，持久化存储</li>
<li>有序，优雅地部署和 scale</li>
<li>有序，优雅地删除和终止</li>
<li>有序，自动的滚动升级</li>
</ul>

<pre class="example">
  稳定是 Pod （重新）调度中持久性的代名词，如果应用程序不需要任何稳定的标识符、有序部署、删除和 scale，则应该使用提供一组无状态副本的 controller 来部署应用程序

  例如 Deployment 或 ReplicaSet 可能更适合您的无状态需求
</pre>
</div>
</div>
<div id="outline-container-orgab35ba9" class="outline-2">
<h2 id="orgab35ba9">限制</h2>
<div class="outline-text-2" id="text-orgab35ba9">
<ul class="org-ul">
<li>给定 Pod 的存储必须由 PersistentVolume Provisioner 根据请求的 storage class 进行配置，或由管理员预先配置</li>
<li><p>
删除或 scale StatefulSet 将不会删除与 StatefulSet 相关联的 volume
</p>
<pre class="example">
    这样做是为了确保数据安全性，这通常比自动清除所有相关 StatefulSet 资源更有价值
</pre></li>
<li><p>
StatefulSets 目前要求 Headless Service 负责 Pod 的网络身份
</p>
<pre class="example">
    使用者有责任创建此服务
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgb6644c7" class="outline-2">
<h2 id="orgb6644c7">组件</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
